In [12]:
import pandas as pd ; import numpy as np

In [13]:
sozluk1={"Isım":["Atıl","Zeynep","Ahmet","Mehmet"],"Spor":["Basketbol","Koşu","Koşu","Yüzme"],
        "Kalori":[150,250,100,200]}

In [14]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [15]:
dataFrame1

     Isım       Spor  Kalori
0    Atıl  Basketbol     150
1  Zeynep       Koşu     250
2   Ahmet       Koşu     100
3  Mehmet      Yüzme     200

In [23]:
sozluk2={"Isim":["Ali","Mehmet","Hasan","Kagan"],"Spor":["Koşu","Yüzme","Koşu","Basketbol"],"Kalori":[400,500,100,200]}
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame2

     Isim       Spor  Kalori
4     Ali       Koşu     400
5  Mehmet      Yüzme     500
6   Hasan       Koşu     100
7   Kagan  Basketbol     200

In [24]:
sozluk3={"Isim":["Ayse","Mahmut","Duygu","Nur"],"Spor":["Koşu","Yüzme","Badminton","Tenis"],"Kalori":[400,500,100,200]}
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     400
9   Mahmut      Yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

## CONTATENATİON

In [26]:
concat=pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)
concat

      Isım       Spor  Kalori    Isim
0     Atıl  Basketbol     150     NaN
1   Zeynep       Koşu     250     NaN
2    Ahmet       Koşu     100     NaN
3   Mehmet      Yüzme     200     NaN
4      NaN       Koşu     400     Ali
5      NaN      Yüzme     500  Mehmet
6      NaN       Koşu     100   Hasan
7      NaN  Basketbol     200   Kagan
8      NaN       Koşu     400    Ayse
9      NaN      Yüzme     500  Mahmut
10     NaN  Badminton     100   Duygu
11     NaN      Tenis     200     Nur